[
  {
    "category": "Condo / Apartment for rent",
    "address": "18, Chemin du Bord-du-Lac-Lakeshore, apt. 410, Pointe-Claire, Neighbourhood South East",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "1,093 sqft",
    "description": "Newly updated 2-bedroom, 2-bathroom condo with captivating lakefront views from every window. Featuring 9 foot ceilings, a bright and spacious open concept living area, a master complete with ensuite bathroom and walk-in closet. Benefit from indoor parking, 24 hour doorman service and the added convenience of automatic water shut-off for peace of mind when you're away. Experience resort-style living with access to Atlantis' amenities, including an indoor heated pool, gym, jacuzzi, sauna, and rooftop terrace equipped with barbecues. This condo offers a perfect blend of luxury, comfort, and security in a prime lakefront location.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/15339620?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2200, boulevard Thimens, apt. 807, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2395",
    "area": "1,307 sqft",
    "description": "Beautiful and spacious 2 bedrooms & 2 bathrooms condo in the luxurious Sommets de Bois Franc. Large living & dining room with panoramic windows. Lots of natural sunlight with afternoon sun with panoramic view of Mount-Royal. High 10 ft ceilings and hardwood floor throughout. Master bedroom comes with ensuite bathroom, all closets are custom. High kitchen cabinets, granite kitchen counters & vanities. Motorized blinds & all appliances included. Gaz connection for BBQ, 1 parking space & locker included. Heated inground pool, sauna, gym & reception rooms with visitors' indoor parking. Close to all amenities.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/10170236?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3581, boulevard Gouin Est, apt. 208, Montréal (Montréal-Nord)",
    "features": "2 beds, 2 baths",
    "price": "$1950",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-montreal-nord/20416750?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "441, Avenue du Président-Kennedy, apt. 1501, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "825 sqft",
    "description": "This bright corner unit is in LE CONCORDE building, a very sought after address that appeals to professionals for its quiet environment. Two bedrooms, one with an en-suite bathroom and the other with views over the Place des Arts. The kitchen is open plan and one can enjoy those warm summer days on the private balcony. Very easy to visit.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/14231187?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6800, Avenue MacDonald, apt. 912, Côte-Saint-Luc",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "1,260 sqft",
    "description": "Le Vicomte, Spacious condo with 2 bedrooms, two full bathrooms SW exposure. Close to all services and public transport. Condo fees including 24/7 security doorman, electricity, heating, hot water, A/C, indoor pool, jacuzzi & sauna, gym, party/card room. Available for rent August 1st",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~cote-saint-luc/24157522?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2350, Rue Wilfrid-Reid, apt. 203, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "Stunning 2-bedroom, 2-bathroom unit in the WR-2 project of Bois-Franc, near the future REM. Enjoy a bright open-plan living space with a modern, fully equipped kitchen. A spacious balcony offers a peaceful setting for dining and relaxation. Includes indoor parking and storage. The building features an elevator and exercise room. Located close to all amenities and public transport. This elegant, inviting space provides comfort and convenience with all appliances included. A prime opportunity for refined living in a desirable neighborhood.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/24939658?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "101, Rue Peel, apt. 1053, Montréal (Le Sud-Ouest), Neighbourhood Griffintown",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "694 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/22730285?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6, Avenue Donegani, apt. 304, Pointe-Claire, Neighbourhood Central East",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "899 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/12711149?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7227, boulevard Newman, apt. 319, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2380",
    "area": "831 sqft",
    "description": "This charming condo offers a comfortable living space with 2 bedrooms and 2 bathroom, ideal for families or couples. Its open concept layout creates a bright and spacious atmosphere, with a kitchen equipped with modern and practical appliances. In addition to its attractive interior features, the location is a real asset. Master bedroom with walk-in closet and ensuite bathroom. 1 indoor parking and storage space. The building offers rooftop swimming pool with terrace and barbecue, gym, yog. The condo is located close to schools, making it ideal for families with children.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/16115176?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5695, Rue Saint-Jacques, apt. 435, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Notre-Dame-de-Grâce",
    "features": "2 beds, 2 baths",
    "price": "$2095",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/13919105?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4410, Chemin de la Côte-des-Neiges, apt. 401, Westmount",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "CÔTE DES NEIGES ADJACENT WESTMOUNT - PENTHOUSE MEUBLÉ 4 ½ 2 CHAMBRES 2 SDB + GARAGE DISPONIBLE IMMÉDIATEMENT - Spacieux penthouse au dernier étage. Inondé de lumière toute la journée ! 2 chambres à coucher : une chambre des maîtres avec salle de bain privative, une 2e chambre de bonne dimension. 2 salle de bains avec bain et douche. Garage. Vue sur la montagne devant et forêt à l'arrière. Il se trouve à quelques minutes à pieds des commerces et des restaurants de la rue Côte des neiges, de l'Université de Montréal, de HEC, de lac au castors et du parc du Mont-Royal. Inclusions : four, frigo, lave-vaisselle, laveuse, sécheuse, garage, meubles.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~westmount/28319635?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2100, Rue Chomedey, apt. 202, Montréal (Ville-Marie), Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "1,025 sqft",
    "description": "Bright, 2 bedroom 2 bathroom condo. Excellent location in downtown Montreal. Great spacious layout, large windows, 9 foot ceilings, recess lighting, fireplace, ensuite bathroom.  A few minutes walking distance to Concordia and McGill ,LaSalle College ,Guy Concordia Metro. Close to all amenities. A must see! parking extra: 175$ per month",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/27756158?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "300, Rue Sainte-Marguerite, apt. 3, Montréal (Le Sud-Ouest), Neighbourhood Saint-Henri",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "900 sqft",
    "description": "Open concept condo perfectly located next to rue Notre-Dame, St-Henri metro station, restaurants, parks and Lachine Canal. 2 closed bedrooms with large walk-in closet, Private balcony, Excellent soundproofing, Including appliances and Washer/dryer in unit,",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/16811404?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3000, boulevard Thimens, apt. 812, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "928 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/18361857?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3535, Avenue Papineau, apt. 216, Montréal (Le Plateau-Mont-Royal), Neighbourhood Le Plateau-Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "823 sqft",
    "description": "exceptional apartment located opposite Park Lafontaine, heating and hot water included, 2 good-sized bedrooms, 2 renovated bathrooms, beautiful open kitchen with quartz counter, dining room and living room with balcony overlooking La Fontaine Park. Laundry room on the 1st and 26th floor. 1 Garage C30, 1 Storage A216, Neww floor",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-plateau-mont-royal/25301669?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 313, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2330",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/14644201?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7227, Avenue M.-B.-Jodoin, apt. 303, Montréal (Anjou)",
    "features": "2 beds, 2 baths",
    "price": "$1900",
    "area": "1,108 sqft",
    "description": "Beautiful condo with lots of natural light on the 3rd floor featuring an open concept with large windows, 2 spacious bedrooms and 2 renovated bathrooms with hardwood floors. It includes 1 garage parking and 1 indoor locker. The owner is giving away a washer and a dryer. Conveniently located near highways (25, 40), galeries d'Anjou, parks, Costco, amenities and much more! Available immediately!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-anjou/17808236?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5150, Rue Buchan, apt. 3210, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2230",
    "area": "Not specified",
    "description": "Spacious and Bright 2-Bedroom, 2-Bathroom condo for rent, located in a newer building and ideally situated in Côte-des-Neiges, just steps away from the Royalmount project! The unit features well-sized rooms, high-quality finishes, and a large private balcony.  The master bedroom includes a large walk-in closet and an en-suite bathroom. Complete with one indoor parking space and a storage locker. Located in a well-maintained building with a large indoor pool and a gym. Within walking distance of public transport and all necessary services. Available immediately!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/17733729?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "120, Rue des Soeurs-Grises, apt. 104, Montréal (Ville-Marie), Neighbourhood La Cité du Multimédia",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "920 sqft",
    "description": "Superb multi-level condo with 2 bedrooms in the historic district of Old Montreal. Very large space and open plan will give you all the comfort you need! Private terrace at the back too! Furniture and appliances are for illustration purposes only. Appliances will be slightly different in reality.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/20244693?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2015, Avenue Aird, apt. 407, Montréal (Mercier/Hochelaga-Maisonneuve), Neighbourhood Hochelaga-Maisonneuve",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "882 sqft",
    "description": "PENTHOUSE à aire ouverte sur 2 niveaux offrant 1 chambre (+1) et 2 salles de bain au design modulable avec panneaux sur rail +++ une belle terrasse de 143p2 donnant accès à la chambre des Maitres. Grand garde-robe avec portes sur pivot et une large fenestration. Plafond de béton 9'p de hauteur** terrasse commune sur le toit avec VUE. Frais de chauffage, électricité climatisation, INTERNET INCLUS. Bail 12 mois minimum renouvelable. Un endroit remarquable où bien vivre!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-mercier-hochelaga-maisonneuve/12438960?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "9500, Avenue Cérès, apt. 301, Montréal (Pierrefonds-Roxboro), Neighbourhood Pierrefonds/East",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,071 sqft",
    "description": "Luxurious penthouse for rent in the heart of Pierrefonds. Offers over 1000sqft of interior living space on two floors, 2 spacious bedrooms with 2 bathrooms and private terrace. The master bedroom offers a walk in closet and ensuite bathroom. Open concept floor plan, with double height ceiling. High end finishings, indoor/outdoor parking included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-pierrefonds-roxboro/26922429?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Hymus, apt. 303, Pointe-Claire, Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2175",
    "area": "1,031 sqft",
    "description": "A stylish 2-bedroom, 2-bathroom corner unit featuring 1,031 sq. ft. of modern living space. With an open concept layout and 9-ft ceilings, this residence offers a spacious & inviting ambiance. The kitchen will impress with its quartz countertops, stainless steel appliances, and ample storage. The living room boasts an electric fireplace, creating a cozy atmosphere. Enjoy superior soundproofing & energy efficiency thanks to the concrete structure. Top-floor amenities include an indoor pool, gym, and panoramic terrace.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/23571548?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1729, boulevard Alexis-Nihon, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "Not specified",
    "description": "Stunning and spacious 2-bedroom, 2-bathroom mezzanine condo in the prime Bois-Franc neighborhood. The modern kitchen features granite counters and stainless steel appliances, and the spacious living/dining room boasts wood floors. Enjoy the private balcony and backyard for relaxation. The condo includes air conditioning and a dedicated laundry room with a washer and dryer. It offers both a garage and an additional exterior parking space. Located near parks and public transportation, this home combines luxury and convenience in an unbeatable setting.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/16768699?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "30, Avenue de la Grande-Allée, apt. 4, Montréal-Est",
    "features": "2 beds, 2 baths",
    "price": "$1900",
    "area": "Not specified",
    "description": "NEW CONSTRUCTION AND SPACIOUS UNIT IN A QUADRUPLEX: 4 ½ (2 bedrooms) This townhouse-style unit on 2 levels (1st floor and basement of the building) offers a bright, open living area with balcony, modern, functional kitchen, air conditioning for added comfort. Built in 2022, peaceful area, 3 brick sides, durable fiberglass and aluminum balconies, lots of storage, strategic location, close to services, public transit, landscaped lot. The opportunity is yours!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-est/19962050?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "440, Rue De La Gauchetière Est, apt. 210, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "769 sqft",
    "description": "-Availability date: Immediately -Inclusions : Refrigerator, stove, dishwasher, washer, dryer, parking and storage space.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/13659202?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1080, Rue Sainte-Élisabeth, apt. 4, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/9849336?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "808, 2e Avenue, apt. 217, Montréal (Lachine), Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2270",
    "area": "927 sqft",
    "description": "welcome to Gardenia. Available in October 2024. A new real estate project where modern design merges harmoniously with nature. Through its outdoor and indoor spaces focused on well-being, Gardenia offers a healthy and active lifestyle in a unifying environment, which promotes sharing and a spirit of community. You will also enjoy a roof terrace with BBQ, Gym and Yoga zone, a co-working space, outdoor sports course and much more! The rent includes all appliances and wifi. Several units available from studios to 3 bedrooms. Contact us for more information.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lachine/23147085?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7145, Avenue Papineau, apt. 209, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2145",
    "area": "Not specified",
    "description": "See plan 209 at: \"lefabre.ca\" Included: 5 appliances Internet,a/c, curtains, blinds.Garage ($150), Quality building built in 2022 and on a human scale (Only 19 units) It is located right opposite the metro Fabre and on Rosemont and Villeray limits. You can live a local life where it is pleasant to walk in these two neighborhoods with its nice shops. Plus, only 9 metro stations and you're in the city center! Elevator. Le Fabre has contemporary architecture and is built in concrete for optimal soundproofing as well as high-end windows by the renowned Alumilex. New BMO branch on the ground floor",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/20553554?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "200, boulevard Marcel-Laurin, apt. 514, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "874 sqft",
    "description": "Cité Midtown l Superb and spacious 2 bedroom and 2 bathroom condo. Open-concept living room, dining room, and kitchen. The kitchen has high-end built-in appliances and plenty of storage. 11-foot ceiling, wall-to-wall windows opening onto a balcony/terrace. Master bedroom with walk-in and adjoining bathroom. Locker and Garage. Prime location, less than 10 minutes walk from the metro and the future Royalmount. A new city park with new children's play areas will be built on the Cite Midtown project site and bike and walking trails will connect to the larger network.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/13574880?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1400, Avenue des Pins Ouest, apt. 1302, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "Not specified",
    "description": "Spacious and bright 2 bedroom with impeccable view of the mountain. Internet included in the rent. Access to an indoor pool, gym sauna and so much more. Direct entrance to a dog park though the garage. Renovated kitchen and bathrooms.A visit is a must. Indoor parking available for 175$/month",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/13996225?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3000, boulevard Thimens, apt. 207, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "922 sqft",
    "description": "Welcome to the new exclusive MONARC CONDO project located in the heart of Ville Saint-Laurent. This west facing unit offers 2 large bedrooms, 2 bathrooms, modern living and kitchen, a locker and an interior garage. This corner open concept unit features 9-foot ceilings, and ample natural light.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/15737694?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5150, Rue Buchan, apt. 3502, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "917 sqft",
    "description": "A nice 2 bedrooms 2 bathrooms condo for rent located in NDG. Enjoy a spacious open concept living space, wood floors, modern finishing, big windows with lots of natural light. Close to all services and amenities, parks and public transportation, shopping centers and much more!  Metro station Namur and Supercentre Walmart are in walking distance. A must-see.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/15352261?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "987, Rue White, apt. 404, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Large apartment for rent of 1235 sf of living space in a sought after area in vsl. There are 2 bedrooms and 2 full bathrooms. Central air conditioning. Renovations: new ceramic floors in kitchen, living room, dining room and bathrooms. New wood floors in the 2 bedrooms. The 2 bathrooms are completely renovated. Indoor parking included. Occupancy October 1st 2024. Book your visit!!!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/21444050?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1288, Rue Saint-Antoine Ouest, apt. 5103, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "660 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/23202431?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "9660, Rue William-Fleming, apt. 102, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$1975",
    "area": "Not specified",
    "description": "LIVE YOUR LUXURY! Beautiful upscale 2 bedroom condo located in a secure building and near a park. High ceilings of almost 9 feet and large windows. Master bedroom with ensuite bathroom. Granite countertops in the kitchen. Wall mounted air conditioner. Balcony with glass railing of 93 square feet. Garage and storage. All appliances and hot water included. Low energy costs. Condo well located near services and transportation. Pets allowed. Welcome to this property!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/28910539?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1900, Rue Suzanne-Coallier, apt. 407, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "881 sqft",
    "description": "Ce superbe condo situé dans CITÉ MIDTOWN se compose de 2 chambres et 2 salles de bains est l'en dispose d'un grand espace de vie et d'une cuisine moderne équipée d'appareils électroménagers et d'un comptoir en granit avec un grand balcon, un stationnement intérieur et un casier.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/21773765?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "112, Chemin de la Pointe-Nord, apt. 709, Montréal (Verdun/Île-des-Soeurs), Neighbourhood Île-des-Soeurs",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "865 sqft",
    "description": "Welcome to The MYX #709: Discover the perfect blend of style, comfort, and convenience in this stunning two-bedroom, two-bathroom apartment featuring an indoor parking space and a storage room. Located in the heart of a vibrant waterfront community, enjoy modern living with easy access to highways, downtown Montreal, and essential amenities. This apartment boasts a spacious layout, ample natural light, and beautiful scenic views. Live close to shopping centers, restaurants, parks, and more, with excellent transportation links for a hassle-free commute.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-verdun-ile-des-soeurs/22863399?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4227, boulevard Saint-Jean, apt. 304, Dollard-des-Ormeaux, Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$1900",
    "area": "750 sqft",
    "description": "Welcome to 4227 St-Jean, this 750 sqft condo with high-end finishings, appliances included, a master bedroom with an en-suite bathroom and walk in closet, and a second bedroom. Open-concept kitchen and living area. Large kitchen island, great for entertaining. One parking included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/13159849?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "925, Croissant du Ruisseau, apt. G-1, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,202 sqft",
    "description": "Perfectly nestled on a private street in Saint-Laurent, this 2-bedroom condo offers a haven of peace. Bathed in natural light, this spacious area ensures unparalleled comfort. Enjoy two large bedrooms and two full bathrooms for ultimate convenience. The harmonious layout of the living room, dining area, and kitchen creates a welcoming space for entertainment or relaxation. Additionally, take advantage of the outdoor parking, indoor pool, and on-site gym to meet all your wellness needs. With easy access to highways 15 and 40, the train station, grocery stores, schools, pharmacies, and Marché Central nearby, this location offers a practical and",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/19728371?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "750, Place Fortier, apt. 704, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2000",
    "area": "1,174 sqft",
    "description": "Occupation immidate!! Tout inclus sauf internet! Centre-Ville St-Laurent!!! Condo de 2 CAC, 2 SDB, Grand Balcon au 7eme étage avec superficie habitation de 1174 Pi2 qui procède 1* stationnement intérieur + Rangement. Localisation magnifique, 5 mins à Cegep St-Laurent, Cegep Vanier, Costco, Marché central, REM et les autre services. Loyers incluent Électricité, Climatisation-Chauffage, L'eau chaude, service commun (Sauna, Piscine intérieure, Espace de rangement intérieur, Salle d'entraînement, Ascenseur)",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/26834552?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6, Avenue Donegani, apt. 311, Pointe-Claire, Neighbourhood Central East",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Awesome two bedroom and two bathroom unit in a great Pointe-Claire community! Huge open floor plan, modern design, complete with wrap-around balcony and all building services. Indoor parking included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/9067290?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "98, Rue Charlotte, apt. 358, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "861 sqft",
    "description": "Superb bright corner unit, one of the most spacious on the block, with two generous bedrooms and two bathrooms. Close to Place-des-Arts, several grocery stores and the green line and orange line metros. Condo fees include hot water. Do not miss!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/19487541?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6850, boulevard des Roseraies, apt. 105, Montréal (Anjou)",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,290 sqft",
    "description": "Bienvenue dans ce condo rénové à Anjou, offrant  une grande cuisine à aire ouverte, 2 grandes chambres, 2 salles de bains complètes, et une superficie habitable de 1290 pieds carrés. Avec une grande terrasse extérieure privée, cet espace allie modernité et confort. Idéalement situé, il offre un accès facile aux commodités locales. Ne manquez pas l'opportunité de vivre dans ce cadre exceptionnel, mariant style moderne et praticité. Contactez-nous pour une visite dès maintenant.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-anjou/20730552?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "9585, Rue Bellerive, Montréal (Mercier/Hochelaga-Maisonneuve), Neighbourhood Mercier",
    "features": "2 beds, 2 baths",
    "price": "$1850",
    "area": "Not specified",
    "description": "Découvrez cette occasion exceptionnelle de résider dans un cadre enchanteur! Ce charmant condo, idéalement situé en face du Parc Bellerive, vous offre une vue imprenable sur les rives changeantes du fleuve, offrant un spectacle naturel saisissant au fil des saisons. Le rez-de-chaussée de cette propriété comprend un espace de vie lumineux à aire ouverte, créant une ambiance conviviale et accueillante. La porte patio dans le salon vous permet un accès direct au balcon, l'endroit parfait pour profiter de moments de détente et de tranquillité. Au sous-sol, vous trouverez deux chambres à coucher offrant le confort nécessaire pour votre quotidien.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-mercier-hochelaga-maisonneuve/11315532?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2151, Rue Léger, apt. 505, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "FLEMING SUR LE PARC, new construction in Lasalle. Available from 15th of July 2024. Condo #505 facing South West. 2 bedrooms 2 bathrooms, 937 sqft. with 1 balcony. Located steps away from Angrignon Park, one of Montreal's most beautiful urban parks, and all the benefits of urban living. Common areas include an indoor gym with access to outdoor workout area, yoga room, co-working space with WiFi and outdoor access, lounge, rooftop pool with terrace and BBQ. Includes 1 indoor parking space, 1 storage unit, Energy Star kitchen appliances, and washer/dryer.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/24641531?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "8945, boulevard Viau, apt. 303, Montréal (Saint-Léonard)",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "Not specified",
    "description": "Occupation décembre 2024, plan et mesure à titre indicatif",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-leonard/24893523?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "8945, boulevard Viau, apt. 305, Montréal (Saint-Léonard)",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "Not specified",
    "description": "Occupation décembre 2024, plan et mesure à titre indicatif",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-leonard/21153833?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6728, Rue D'Iberville, Montréal (Rosemont/La Petite-Patrie), Neighbourhood La Petite-Patrie",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "Not specified",
    "description": "Logement 4 1/2 au rez de chaussée sur 2 étages, complètement rénové en 2023-2024 (secteur Rosemont). Le rez-de-chaussée comprend 2 chambres à coucher, un grand salon donnant sur la terrasse intérieure, une cuisine neuve, salle de bains neuve et plancher neuf. Au sous-sol se trouve une grande salle familiale, une salle d'eau neuve avec installation laveuse sécheuse et une grande pièce de rangement. Tous les électroménagers sont neufs et inclus avec la location. Vous profiterez également d'une thermopompe chauffage et climatisation. À distance à pied du métro et de tous les transports en commun et à 2 minutes du Parc Molson.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-rosemont-la-petite-patrie/17326098?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5010, Rue Sherbrooke Ouest, apt. 16, Westmount",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~westmount/21297682?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2555, Rue Modugno, apt. 201, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "1,038 sqft",
    "description": "Beautifully maintained 2-bedroom, 1-bathroom condo in the heart of Saint Laurent. This charming home features a bright living area, modern kitchen, cozy bedrooms, and an updated bathroom. Ideally located close to top-rated schools, Place Vertu Shopping Centre, the local library, and excellent public transport options. Quick access to Highway 40 and Decarie ensures convenient commuting. Schedule a viewing today and make this wonderful condo your new home!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/21289095?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "14399, boulevard Gouin Ouest, apt. 508, Montréal (Pierrefonds-Roxboro), Neighbourhood Pierrefonds/Central West",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Welcome to AQUASOLE, where luxury meets convenience! This stunning 5th floor 2-bedroom, 2-bathroom condo offers all you need for comfortable living. Key features include modern finishings, a large balcony with direct views of Rivière des Prairies, all appliances included, air conditioning, and indoor parking with storage (plus an optional second spot at $120/month). Located near Boul. St-Jean, Boul. Pierrefonds, PCSH high school, Cégep Gérald-Godin, Pierrefonds Library, Maxi, Palumbo, restaurants, and Fairview, you'll enjoy the tranquility of riverside living with city amenities. Don't miss this chance to call AQUASOLE home!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-pierrefonds-roxboro/25907334?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6900, boulevard Newman, apt. 507, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "930 sqft",
    "description": "EQ8 CITE URBAINE LASALLE. 2 bedroom + 2 bathroom (1 ensuite) unit with 1 locker and 1 parking included !    Location: steps away to Carrefour Angrignon, park Angrignon, Metro and terminus Angrignon.   10 mins drives to Montreal Downtown.   Nearby to Supermarkets, restaurants, gym and all amenities.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/28141761?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "88, Rue Charlotte, apt. 804, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2000",
    "area": "855 sqft",
    "description": "A big 2 bedrooms 2 bathrooms unit in the downtown of Montreal. 3 minutes to Metro St Laurent and Chinatown. Close to supermarket, bank, universities and etc...You also have a private locker in the basement. Come to have a visit! Available for September 1st!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/16817523?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4141, boulevard LaSalle, apt. 301, Montréal (Verdun/Île-des-Soeurs), Neighbourhood Verdun",
    "features": "2 beds, 2 baths",
    "price": "$2000",
    "area": "788 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-verdun-ile-des-soeurs/22090590?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3465, Chemin de la Côte-des-Neiges, apt. 25, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$1750",
    "area": "Not specified",
    "description": "Magnificent open concept condo in the heart of downtown, Fully FURNISHED, walk to Mc Gill universities and 2 minutes to Concordia, 2 minutes from Guy Concordia metro, close to all amenities. Ideal for professionals or students. quality finish, hardwood floors, granite countertops, magnificent shared terrace with breathtaking views of Montreal.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/17466307?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1300, Rue Alain-Grandbois, apt. 306, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,100 sqft",
    "description": "Imaginez un Superbe Condo luxueux de 1100 PC, Unité de Coin construction 2008, combine l'élégance et la praticité dans un immeuble contemporain de sept étages, unité de coin; ensoleillé à longueur de journée avec ses grandes fenêtres et un énorme balcon qui vous offre le plaisir d'une vue amusante et vivante. Salon élégant spacieux avec salle à manger à aire ouverte (La vue de la salle à manger et Salon est tout simplement magnifique et apaisante), planchers Bois-franc de qualité, Cuisine lux Open concept avec un comptoir de Granite, très lumineuse, 2 grandes chambres à coucher avec Walk-in Closets, 2 salles de bains modernes avec 2 baignoire",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/11905374?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7871, Rue George, apt. 202, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,085 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/11534470?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5725A, Avenue de l'Esplanade, Montréal (Le Plateau-Mont-Royal), Neighbourhood Mile-End",
    "features": "2 beds, 2 baths",
    "price": "$2450",
    "area": "Not specified",
    "description": "THE MILE-END!!! a superb area in high demand, you have a beautiful appartment located on the ground floor all FURNITURE included with 2 bedrooms, a kitchen, a living room, a dining room, a bathroom and a powder room with washer and dryer!! Beautiful and clean close to cafes, restaurants, markets, clinics, schools, daycares, bike paths...everything you need...for a pleasant neighborhood life!!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-plateau-mont-royal/27706804?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1750, Rue Saint-Louis, apt. 308, Montréal (Saint-Laurent), Neighbourhood Old Saint-Laurent",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,008 sqft",
    "description": "This beautiful condo is located in a prime area, just a short walk from the metro and various commercial arteries. It features 2+0 bedrooms, 1+1 bathroom, beautiful living room, open living space and spacious kitchen. The well-maintained building features a small gym, and the unit comes with indoor parking and storage space.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/13403697?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "8, Avenue Donegani, apt. 612, Pointe-Claire, Neighbourhood Central East",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "976 sqft",
    "description": "The condo that has it all - roof top inground pool, 2nd inground outside pool, gym, community room, garage and locker. Immaculate 2 bedroom 2 bathroom end unit condo on the 6th floor. Hardwood engineered flooring,  ceramic backsplash in kitchen, open concept filled with sunshine. Wall mounted air conditioning, window coverings, fixtures and appliances. Immediate occupancy",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/20834942?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "808, 2e Avenue, apt. 117, Montréal (Lachine), Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2190",
    "area": "927 sqft",
    "description": "Welcome to Gardenia: where luxury meets comfort and convenience. This new luxury 2 bedroom 2 full bathroom condo rental is designed to provide an unparalleled living experience. Located in Lachine 15 min from downtown, Gardenia offers a haven of sophistication and style.  Included in the rent price are a range of top-tier amenities to enhance your lifestyle: Enjoy the convenience of stainless steel appliances, including a fridge, stove, dishwasher, and microwave. In-Unit Features: Each unit comes equipped with a washer and dryer, ensuring laundry day is a breeze. Plus, stay connected with high-speed Wi-Fi, hot water included and air condition",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lachine/9479068?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5720, boulevard Cavendish, apt. 1102, Côte-Saint-Luc",
    "features": "2 beds, 2 baths",
    "price": "$1925",
    "area": "988 sqft",
    "description": "Beautiful large apartment located on the 11th floor in the Presidential Towers complex with two bedrooms, two bathrooms plus a garage and storage.Impressive view from the balcony to the Mont Royal mountain, while the apartment is located away from the road, the apartment is well insulated.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~cote-saint-luc/13459607?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6843, Avenue Lamont, Montréal (Le Sud-Ouest), Neighbourhood Ville-Émard",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "830 sqft",
    "description": "Location within walking distance of Angrignon Metro! Condo on 2 levels, open concept, 2 bedrooms, 2 full bathrooms, private outdoor parking. Heat pump, air exchanger, engineered wood floors. Welcome!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/25770492?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "285, boulevard Hymus, apt. 804, Pointe-Claire, Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2165",
    "area": "932 sqft",
    "description": "To book a visit OR get more information please call 514-262-9055 OR email at: zehava@ekhoury.ca Spacious, luminous 932 sqft. apartment offering 2 bedrooms & 2 bathrooms AVAILABLE October 1st, 2024. Discover FYNA - 285 Hymus Blvd., a luxurious rental building offering amenities such as an indoor pool, fully equipped gym, rooftop terrace and study space. INCLUDES: Hot water, high-speed Internet with Bell, window coverings, electric fireplace & 6 appliances: stove, fridge, dishwasher, Over-the-Range Microwave, washer/dryer. Excluded: Parking & Locker.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/13622778?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "901, Avenue Beaumont, apt. 108, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Parc-Extension",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "Discover your dream 2-bedroom condo in a vibrant, developing area, overlooking the prestigious new University of Montreal campus. Conveniently located near l'Acadie metro and all essential amenities. Experience the allure of new reinforced concrete construction with excellent insulation, creating a radiant living space. Embrace the perfect blend of modern design and comfort.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/22309094?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6851, boulevard des Roseraies, apt. 203, Montréal (Anjou)",
    "features": "2 beds, 2 baths",
    "price": "$1850",
    "area": "1,082 sqft",
    "description": "À louer à Anjou: Un magnifique condo de coin disponible dès le 1er septembre. Situé dans un emplacement idéal, cet appartement offre tout le confort dont vous avez besoin pour vous sentir chez vous. Deux espaces de rangement et deux places de stationnement incluses : une place au garage et une autre place à l'extérieur. Ne manquez pas cette opportunité unique!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-anjou/19851143?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1900, Rue Suzanne-Coallier, apt. PH809, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "697 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/20105898?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4, Place des Jardins-des-Vosges, apt. 133, Montréal (Verdun/Île-des-Soeurs), Neighbourhood Île-des-Soeurs",
    "features": "2 beds, 2 baths",
    "price": "$2490",
    "area": "880 sqft",
    "description": "Famous JARDINS-DES-VOSGES luxury condo with 2 bedrooms and 2 bathrooms is located in the heart of Nuns' Island, surrounded by a fountain and beautiful trees. This cozy and peaceful apartment is on the first floor of a lovely French building. It features two opposite bedrooms, two full bathrooms with bathtubs and showers, a large living room with a dining area, and an open-concept kitchen. Hardwood floors, high ceilings (10 feet) and lots of natural light create a bright and airy atmosphere. The living room opens directly onto a private patio! There is also a private underground parking space with a bike rack, plus a storage unit. MUST SEE!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-verdun-ile-des-soeurs/11826745?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1392, Avenue Overdale, Montréal (Ville-Marie), Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2195",
    "area": "Not specified",
    "description": "Exquisite 2 level unit featuring 2 spacious bedrooms and 1+1 bathrooms located in a charming grey stone building. Featuring exposed brick, stone walls, open concept living area ideal for entertaining, large windows allowing for an abundance of natural light and a large private balcony. Primarily located steps away from metro Lucien-L'Allier, the Bell Center, grocery stores and all other amenities.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/19655019?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2355, Rue des Équinoxes, apt. 216, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "Not specified",
    "description": "Beautiful 2 large bedrooms & 2 bathrooms corner condo in the brand-new project AURA in Bois-Franc. High windows with abundant natural light, open concept layout, modern kitchen with end high appliances. Primary bedroom with walk-in closet and ensuite bathroom. Second large bedroom and nice sized bathroom. All the appliances and hot water included as well, 1 indoor parking and 1 locker, building with 2 elevators, gym, and rooftop terrace. Located in a prestigious project offers high-end finishes, ample natural light, and exceptional soundproofing offering top-tier amenities & great location. Don't miss this opportunity to  live in this condo.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/11688039?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1275, Rue Bélanger, Montréal (Rosemont/La Petite-Patrie), Neighbourhood La Petite-Patrie",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Large 4 1/2 newly renovated, located on the 2nd floor of a well maintained building in the heart of Rosemont. Located 5 minutes walk from Fabre metro and 10 minutes walk from Jean Talon metro, the unit has 2 bedrooms with storage, 2 bathrooms, an open air living space with a front balcony and a quiet rear terrace. You will have, in addition, a parking space in the closed garage. Near under the services of the Petite-Patrie. Available for July 1, 2024! Come and see!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-rosemont-la-petite-patrie/11786352?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "10120, Rue Lauraine-Vaillancourt, apt. 103, Montréal (Ahuntsic-Cartierville), Neighbourhood Ahuntsic West",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "Stunning open concept Large, bright, and spacious 2bd 2bth brand new condo includes appliances, lights, and blinds, central AC, storage locker and indoor parking, excellent finishing and on the ground floor with private garden and greenspace with outdoor pool view. Great concrete building equipped elevators, gym, rooftop terrace. Near schools, daycare, park, shopping, dinning and more.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/26797831?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "869, Avenue Viger Est, apt. 205, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2375",
    "area": "1,130 sqft",
    "description": "Downtown / Quartier Latin - Facing Old Montreal and at 3 minutes walk from the CHUM Hospital - 2nd floor, beautiful condo, very spacious, sunny and impeccable,  with 2 closed bedrooms and 2 full bathrooms, a large walking-closed, A/C, private balcony, locker and a common top-roof terrace. One private outdoor parking space is included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/12860387?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "285, boulevard Hymus, apt. 612, Pointe-Claire, Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2310",
    "area": "1,092 sqft",
    "description": "To book a visit OR get more information please call 514-262-9055 OR email at: zehava@ekhoury.ca Spacious, luminous 1,092 sqft. apartment offering 2 bedrooms & 2 bathrooms AVAILABLE September 1st, 2024. Discover FYNA - 285 Hymus Blvd., a luxurious rental building offering amenities such as an indoor pool, fully equipped gym, rooftop terrace and study space. INCLUDES: Hot water, high-speed Internet with Bell, window coverings, electric fireplace & 6 appliances: stove, fridge, dishwasher, Over-the-Range Microwave, washer/dryer. Excluded: Parking & Locker.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/28750835?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "9801, Rue Cérès, apt. 602, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2490",
    "area": "1,110 sqft",
    "description": "Welcome to 9801 Boisé Cérès in Dollard-des-Ormeaux, a peaceful residential neighborhood on the West Island of Montreal. This newly-constructed building is nestled in greenery, just steps from parks and all amenities: shops, public transit, clinics, etc. Its proximity to the Sunnybrooke REM station also means you can get to the city in just a few minutes. This luxurious two-bedroom corner apartment offers refined finishes, natural light thanks to its large windows, and a superb private terrace. The benefits of condo living with the tranquility of the suburbs.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/19129276?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1900, Rue Suzanne-Coallier, apt. 113, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "Enquête de crédit ou preuve de revenu à l'entière satisfaction du locateur (vérification de certaines informations du locataire potentiel : pièces d'identité, preuve d'emploi, visa de travail, etc.). Vérification de la preuve d'assurance responsabilité civile (2,000,000$).",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/19893460?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2355, Rue Wilfrid-Reid, apt. 210, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "808 sqft",
    "description": "Stunning corner unit offering 9' ceilings with open concept and two balconies. An abundance of natural light during the day and beautiful evening sunset views. Modern kitchen including quality appliances as well as light fixtures and custom blinds. 2 bedrooms with an ensuite in the master bedroom. Parking and storage included. Available August 1st, 2024. A must see!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/16315315?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "248, boulevard Hymus, apt. 603, Pointe-Claire, Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "998 sqft",
    "description": "Le Seville Condominiums project, 2 bedroom and 2 bathroom located on 6th floor with nice view in Pointe-Claire. Open concept with living/dining room. Modern kitchen with superior appliances. Sunny west orientation bring the bright bedrooms. Private parking spot and locker. A common gym & indoor pool. Walking distance of the Central Market, public transportation, and several parks. Immediate occupancy available.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/27968679?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "201, Avenue Metcalfe, apt. 805, Westmount",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "Not specified",
    "description": "Welcome to your apartment in the heart of Westmount! This spacious 2-bed, 2-bath gem boasts modern finishes and an unbeatable location. Move right in and start living your best urban life.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~westmount/21355636?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "200, boulevard Marcel-Laurin, apt. 616, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2390",
    "area": "924 sqft",
    "description": "This stunning condo located in CITÉ MIDTOWN consists of 2 bedrooms and 2 bathrooms and features a large living space and a modern kitchen equipped with appliances and a granite countertop with a locker and a large balcony. indoor parking is available at extra cost.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/26725392?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Brunswick, apt. 307, Pointe-Claire, Neighbourhood North",
    "features": "2 beds, 2 baths",
    "price": "$2265",
    "area": "Not specified",
    "description": "**LIMITED PROMO - ONE MONTH FREE ** Enjoy a refined, stress-free lifestyle in the heart of Pointe-Claire. Westpark, the new high-end rental condo complex in Pointe-Claire. This community of 255 1- to 3-bedroom apartments represents the perfect balance between urban living and proximity to all services with its 15-minute neighbourhood. Picture an ideal location where all your needs are just steps away. Within walking distance, you'll have privileged access to a variety of first-rate stores, including the prestigious CF Fairview Pointe-Claire, for an unparalleled shopping experience.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/28951553?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2000, Rue Sauvé Ouest, apt. 512, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2275",
    "area": "Not specified",
    "description": "PROMOTION: One month of free rent. Welcome to Voltige: Common areas and services:  Urban chalet featuring a pool table, large-screen TV, gas fireplace, and fully equipped kitchen for cozy get-togethers Terrace with BBQ and dining areas Outdoor pool Fully equipped gym Party room for special events Indoor and outdoor parking Bicycle parking Concierges and security guard Charging stations for electric vehicles",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/12035180?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "111, boulevard Alexis-Nihon, apt. 222, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2115",
    "area": "1,056 sqft",
    "description": "Le Cent-Onze offers all the perks of a multiuse residential development at a more modest price point. Here, modesty doesn't mean less. It means more amenities, more access, more opportunities for contentment, but within the intimacy of a tight-knit community. To offer you this exceptional living environment, our team has equipped itself with the best technologies available to allow you to enjoy the attractions of Le Cent-Onze in complete security. Doors lockable with your phone, facial recognition at the entrance, and surveillance 24/7, nothing has been left to chance!Rosefellow is proud to sign its very first residential real estate project!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/21073114?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 413, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2345",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/21438302?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Brunswick, apt. 1112, Pointe-Claire, Neighbourhood North",
    "features": "2 beds, 2 baths",
    "price": "$2080",
    "area": "Not specified",
    "description": "**LIMITED PROMO - ONE MONTH FREE ** Enjoy a refined, stress-free lifestyle in the heart of Pointe-Claire. Westpark, the new high-end rental condo complex in Pointe-Claire. This community of 255 1- to 3-bedroom apartments represents the perfect balance between urban living and proximity to all services with its 15-minute neighbourhood. Picture an ideal location where all your needs are just steps away. Within walking distance, you'll have privileged access to a variety of first-rate stores, including the prestigious CF Fairview Pointe-Claire, for an unparalleled shopping experience.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/17930111?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2805, Chemin Bates, apt. 207, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2490",
    "area": "Not specified",
    "description": "Introducing LE 3MIL: Your modern sanctuary in the heart of Outremont/Mount-Royal, Montreal. This brand-new apartment complex offers contemporary living with a suite of amenities included in your rent: WiFi, high-speed internet, window coverings, security panels, and 5 premium Samsung appliances. Enjoy the spaciousness of 9' ceilings and the convenience of public transit, supermarkets, schools, parks, and more just steps away. Parking available for your convenience. Visit le3mil.com for more details!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/12513081?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 312, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2330",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/18059365?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 1309, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2280",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/24342930?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 1409, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2285",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/21752967?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 613, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2305",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/28593153?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6760, boulevard Newman, apt. 1209, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2290",
    "area": "Not specified",
    "description": "Primarily located within 5 mins from Angrignon metro / public transport,Park & Carrefour Angrignon.Spacious units (1-2 bdr units) avail for immediate occupancy.Luxurious finishes w/quartz kitchen countertops,high ceilings,large quality windows allowing an abundance of natural light.Locker icl.Garages avail",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/27492499?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "630, Rue William, apt. 923, Montréal (Ville-Marie), Neighbourhood La Cité du Multimédia",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "This unit is a rare and unique find. The height in the unit is 10'-6\", giving it an incredible inspiring ambiance. A huge balcony 42' x 6', imagine the private outdoor balcony parties. Central air conditioning that provides a cool breeze in the living area as well as the master bedroom with room controls. Doorman during the week who also caters to your requests. Private gym over looking courtyard. All appliances are provided. Private interior parking right next to the elevator lobby. As well as a private storage locker beside parking spot.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/18168545?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1111, Rue Arthur-Lismer, apt. 702, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,151 sqft",
    "description": "Ahuntsic-Cartierville sector. Magnificent 5 1/2 corner condo located in a prestigious building with breathtaking South/East views. Large living room with abundant windows, L-shaped dining room with a completely renovated kitchen with window, balcony forming the corner, master bedroom with walk-in closet and adjoining bathroom, second bedroom and bathroom. Washer and dryer in a closet at the entrance. Indoor garage with individual storage space. Located in a sought-after area close to services, the Central Market, train, bus to three directions, Sauvé and Côte-Vertu metro stations.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/27712250?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "205, Chemin Bates, apt. 604, Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2290",
    "area": "Not specified",
    "description": "Luxurious condo in Ville Mont-Royal, construction 2023, on the 6th floor, 2 bedrooms, 2 bathrooms including one in the master bedroom, walk-in wardrobe in the master bedroom, shed included, indoor parking included, parking spaces for visitors, hot water included, 5 appliances included, very large balcony with view of the Laurentians and the sunset, no rear neighbors, gymnasium in the building, very secure, intercom on cell phone, very well soundproofed, central air conditioning , access to the best schools in Mont-Royal, 5 minutes from Canora station and Outremont restaurants/cafes. Accepted animals. Available July 1st.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~mont-royal/9306121?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3550, Rue de la Montagne, apt. 108, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "939 sqft",
    "description": "Welcome to 3550 \"Terasses de la Montagne\". This bright and spacious multilevel condo offers you a large open concept kitchen/dining/living room area with a wood fireplace on one the main level, a spacious master bedroom and walkin closet, a 2nd good sized bedroom , direct walk out to a large private fenced deck on and a powder room/vestibule on 3rd level!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/18501232?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4400, Rue D'Iberville, apt. 101, Montréal (Le Plateau-Mont-Royal), Neighbourhood Le Plateau-Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2055",
    "area": "1,257 sqft",
    "description": "Discover this spacious and bright unit on 2 floors located in the Plateau. Take advantage of a terrace to enjoy the outdoors. The large rooms, including 2 bedrooms, a living room and an open concept kitchen, offer a generous living space. You will appreciate the heated wood floor and the high ceilings. With a shower room and a bathroom with shower, everything has been designed for your comfort. A storage space is included. To make your daily life easier, you will find supermarkets, a convenience store, a park, as well as the Mont-Royal and Préfontaine metro stations nearby.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-plateau-mont-royal/27161652?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2900, Chemin de la Côte-de-Liesse, apt. 103, Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,000 sqft",
    "description": "Superb newly renovated unit in the heart of Town of Mount Royal. Large, bright 2-bedroom, 2-bathroom unit strategically located 2 steps from the highway and Rockland Centre. Inclusions: stove, refrigerator. Possibility of renting a garage for $135. Not to be missed!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~mont-royal/20325534?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 1, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$1975",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/27257520?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 5, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2225",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/16255207?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4500, Chemin de la Côte-des-Neiges, apt. 907, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2450",
    "area": "Not specified",
    "description": "Beautiful open concept penthouse condo located on the top floor of a secure and well maintained building near all amenities. Features 2 good size BDRs - (possibility to install a home office), 2 full bathrooms as well as a large private terrace with an unobstructed view on the forest. Large windows facing west which also brings a nice natural light to the unit. Fully equipped kitchen - high end appliances. Ensuite bathroom to the master bedroom. Indoor parking and a storage unit are also included. Just steps away from Mount Royal, HEC, UdeM and downtown!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/22726814?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 7, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2275",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/15075024?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1150, boulevard René-Lévesque Est, apt. 1213, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "782 sqft",
    "description": "Located in the Quartier des lumières, this 2-bed, 2-bath condo showcases modern living and offers a beautiful view of downtown Montreal from the balcony. It boasts 9-foot concrete ceilings, a sleek kitchen with quartz countertops and built-in appliances, a master suite with a walk-in closet and ensuite bathroom, and a spacious second bedroom with a second bathroom. Additional highlights include a laundry room, a balcony, a locker room, and an indoor parking space.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/17634026?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 6, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/27453756?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 4, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2150",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/28358120?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2555, Rue Modugno, apt. 808, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "Not specified",
    "description": "JUST RENOVATED!!! Bright and open 2 bedroom apartment with concierge service.  Primary bedroom with ensuite bathroom.  Spread out in this large floor plan with eat-in kitchen and plenty of storage.  This concrete apartment will lend to peaceful nights and privacy and comes with central air conditioning.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/10572064?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "9801, Rue Cérès, apt. 406, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2275",
    "area": "1,110 sqft",
    "description": "Welcome to 9801 Boisé Cérès in Dollard-des-Ormeaux, a peaceful residential neighborhood on the West Island of Montreal. This newly-constructed building is nestled in greenery, just steps from parks and all amenities: shops, public transit, clinics, etc. Its proximity to the Sunnybrooke REM station also means you can get to the city in just a few minutes. This luxurious two-bedroom apartment offers refined finishes, natural light thanks to its large windows, and a superb private terrace. The benefits of condo living with the tranquility of the suburbs.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/27720063?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "441, Avenue du Président-Kennedy, apt. 1903, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "798 sqft",
    "description": "Bright 2 bedroom unit located in the prestigious \"The Concorde\". The two bedrooms are laid out on opposite sides, allowing for a true open-concept space. The top floor unit, surrounded by downtown views.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/26871974?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6183, Avenue Gérard-Morisset, Montréal (Mercier/Hochelaga-Maisonneuve), Neighbourhood Mercier",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "Not specified",
    "description": "Grand appartement offert en location situé au 2e étage d'un majestueux duplex de construction récente. Constitué de 6 pièces, 3 chambres à coucher,2 salle de bains ,cuisine salon et salle à manger à aire ouverte. Fraichement rénové vous n' aurez qu'a vous installer.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-mercier-hochelaga-maisonneuve/22299383?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2805, Chemin Bates, apt. 103, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2060",
    "area": "Not specified",
    "description": "Introducing LE 3MIL: Your modern sanctuary in the heart of Outremont/Mount-Royal, Montreal. This brand-new apartment complex offers contemporary living with a suite of amenities included in your rent: WiFi, high-speed internet, window coverings, security panels, and 5 premium Samsung appliances. Enjoy the spaciousness of 9' ceilings and the convenience of public transit, supermarkets, schools, parks, and more just steps away. Parking available for your convenience. Visit le3mil.com for more details! [PHOTOS OF MODEL UNIT]",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/24479625?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1400, Avenue des Pins Ouest, apt. 704, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "Not specified",
    "description": "Spacious and bright 2 bedroom with impeccable view of the mountain. Internet included in the rent. Access to an indoor pool, gym sauna and so much more. Direct entrance to a dog park though the garage. Renovated kitchen and bathrooms.A visit is a must. Indoor parking available for 175$/month",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/24756192?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "55, boulevard Brunswick, apt. 607, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "Not specified",
    "description": "Welcome to Westwalk, your new prestigious address in Dollard-des-Ormeaux where luxury and comfort converge to create an unmatched living environment.  Westwalk is an exceptional rental condo project where every aspect has been carefully considered to enrich your daily life and enhance your quality of living.  By incorporating numerous inclusions to simplify residents' daily lives, and offering exclusive access to high-end communal spaces, Westwalk sets a new standard for well-being and sociability.  Westwalk is not just a place to live; it's a promise of an elevated lifestyle, where the exceptional becomes the everyday.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/27043986?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "55, boulevard Brunswick, apt. 314, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2050",
    "area": "Not specified",
    "description": "Welcome to Westwalk, your new prestigious address in Dollard-des-Ormeaux where luxury and comfort converge to create an unmatched living environment.  Westwalk is an exceptional rental condo project where every aspect has been carefully considered to enrich your daily life and enhance your quality of living.  By incorporating numerous inclusions to simplify residents' daily lives, and offering exclusive access to high-end communal spaces, Westwalk sets a new standard for well-being and sociability.  Westwalk is not just a place to live; it's a promise of an elevated lifestyle, where the exceptional becomes the everyday.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/28713439?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3455, Rue Drummond, apt. 705, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,200 sqft",
    "description": "Welcome to this Bright & spacious 2-bedroom, 2-bathroom in downtown Montreal. A generous sized master bedroom with ensuite bathroom and a spacious walk-in closet. A unit with both relaxation and privacy. With the convenience of a garage spot and storage spot included. Step out onto the private balcony to soak in breathtaking views of the city skyline and mountains. The building offers security & amenities such as a rooftop pool and terrace. Centrally located  in the heart of Montreal.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/11936277?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4060, boulevard des Sources, apt. 408, Dollard-des-Ormeaux, Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2150",
    "area": "Not specified",
    "description": "Live in this beautiful 2 bedroom 2 bath condo in the luxury building \"Le Winston\". The unit has 2 indoor parking spots with indoor storage. Appliances are also included and the unit is available for immediate occupancy.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/27050598?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1700, boulevard René-Lévesque Ouest, apt. 202, Montréal (Ville-Marie), Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "1,065 sqft",
    "description": "Welcome home to this stylish 2-bedroom, 2-bathroom apartment nestled in the heart of downtown Montreal. Enjoy the convenience of urban living with easy access to vibrant shops, trendy restaurants, and cultural attractions. Facing Rene-Levesque. La closerie offers, 24 hours doorman, gym, roof top terrasse, bbq in the yard, reception hall. Available September 1st, 2024.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/18715866?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5050, boulevard de l'Assomption, apt. 1201, Montréal (Rosemont/La Petite-Patrie), Neighbourhood Cité-Jardin",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-rosemont-la-petite-patrie/18922410?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "11201, boulevard Cavendish, apt. 505, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "1,124 sqft",
    "description": "24H notice for visits",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/27454754?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "11201, boulevard Cavendish, apt. 405, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2475",
    "area": "1,049 sqft",
    "description": "24H notice for visits",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/25560981?view=Summary"
  },
  {
    "category": "Condo for sale or for rent",
    "address": "329, Rue Hyman, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$1995",
    "area": "1,302 sqft",
    "description": "Fully renovated townhouse with 2 beds, 1 bath and 1 powder room with lots of natural light. A few minutes away from grocery stores, public transportation, pharmacy, restaurants and shops. Located in a family neighbourhood with common exterior pool and events room. Driveway included. A must see!",
    "summary_url": "https://www.centris.ca/en/condo~a-vendre~dollard-des-ormeaux/21488304?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5050, boulevard de l'Assomption, apt. 514, Montréal (Rosemont/La Petite-Patrie), Neighbourhood Cité-Jardin",
    "features": "2 beds, 2 baths",
    "price": "$2050",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-rosemont-la-petite-patrie/11680078?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1180, Rue De Bleury, apt. 801, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2371",
    "area": "681 sqft",
    "description": "Welcome to Le Livmore! A luxurious brand new rental project located in the heart of downtown Montréal on the corner of Bleury & René-Lévesque Boul, steps from Place-des-Arts metro. Le Livmore has been meticulously crafted with rich materials offering comfort and elegance.This tower features spacious units from studios,1 bdr,2 bdr,3 bdr units to Penthouse suites. Units feature stainless appliances, high ceilings, modern finishes, floor to ceiling windows with exceptional views of the city. Le Livmore lifestyle, residents enjoy experiences with over 20,000 SF of amenities: pool, gym, speakeasy, private work areas, yoga room, dog friendly & more",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/23807056?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7070, boulevard Newman, apt. 904, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "950 sqft",
    "description": "Discover urban living at its best with this brand-new two-bedroom condo with 2 full bathroom on the 9th floor of the prestigious Satori project, with 1 garage and 1 locker. Located next to the Angrignon metro station, steps from Angrignon Park, across from Carrefour Angrignon shopping center and close to all amenities. A Satori project unmatched in sophistication and convenience, this residence offers the perfect blend of style and affordability.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/23445484?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4420, Avenue de Kent, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "**AVAILABLE SEPTEMBER 2024** Welcome to 4420 av. de Kent! This lovely apartment is located on the ground floor of a well-maintained duplex. With 2 bedrooms and a finished basement, this unit is sure to charm you thanks to its sunny views, arched doorways, and hardwood floors. A true gem in the heart of Côte-des-Neiges. Prime location very close to Plamondon metro, hospitals and universities. Welcome home!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/17819435?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1180, Rue De Bleury, apt. 1101, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2453",
    "area": "681 sqft",
    "description": "Welcome to Le Livmore! A luxurious brand new rental project located in the heart of downtown Montréal on the corner of Bleury & René-Lévesque Boul, steps from Place-des-Arts metro. Le Livmore has been meticulously crafted with rich materials offering comfort and elegance.This tower features spacious units from studios,1 bdr,2 bdr,3 bdr units to Penthouse suites. Units feature stainless appliances, high ceilings, modern finishes, floor to ceiling windows with exceptional views of the city. Le Livmore lifestyle, residents enjoy experiences with over 20,000 SF of amenities: pool, gym, speakeasy, private work areas, yoga room, dog friendly & more",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/16504833?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "990, Rue Jules-Poitras, apt. 301, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,150 sqft",
    "description": "Magnificent luxury condo in Les Jardins Montpellier phase II. Renovated and Spacious corner unit facing park with fun for children, abundant windows. Terrace with patio with sunset view/1200 gross sqft including air-climate heat pump, garage/locker and visitor parking, 2 elevators 2 large bedrooms 2 double wardrobes master bedroom. 2 bathrooms. Close to all suburban train services, highway 15/40. Close to Marcher Central & Sami fruits exterior. Very quiet building. It's a Must!!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/25983917?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7171 - Z, Rue Bélanger, apt. 102, Montréal (Anjou)",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "Superbe condo, unité de coin très ensoleillée, libre pour occupation immediate tout meublé , à côté du centre commercial Galeries d'Anjou et de nombreuse commodités. Concept aire-ouverte, 2 salles de bains dont une attenante à la chambre principal, grand balcon, stationnement, facile d'accès aux transports en commun et aux axes routiers. NON Fumeurs et aucun animal permis",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-anjou/10735769?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "12, Rue Davignon, apt. 819, Dollard-des-Ormeaux, Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Welcome to Westwalk, your new prestigious address in Dollard-des-Ormeaux where luxury and comfort converge to create an unmatched living environment.  Westwalk is an exceptional rental condo project where every aspect has been carefully considered to enrich your daily life and enhance your quality of living.  By incorporating numerous inclusions to simplify residents' daily lives, and offering exclusive access to high-end communal spaces, Westwalk sets a new standard for well-being and sociability.  Westwalk is not just a place to live; it's a promise of an elevated lifestyle, where the exceptional becomes the everyday.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/10563439?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 3, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2175",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction. Delivery will be October 2024.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/13257658?view=Summary"
  },
  {
    "category": "Condominium house for rent",
    "address": "180D, Amherst Road, Beaconsfield, Neighbourhood Beacon Hill (North East)",
    "features": "2 beds, 2 baths",
    "price": "$1800",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/maison-en-copropriete~a-louer~beaconsfield/26614265?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2000, Rue Remembrance, apt. 614, Montréal (Lachine), Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2025",
    "area": "Not specified",
    "description": "Amazing Modern Apartments in Lachine! New Construction!  Includes: Fridge, stove, washer/dryer in-unit, dishwasher, and A/C wall-mounted unit inside the apartment.  Utilities included: Hot water.  Building amenities: gym and co-working space.  Near Highway 20, 15 minutes away from downtown Montreal, and less than 10 minutes away from Pierre Elliott Trudeau Airport. Contact us for more information about other layouts (townhouses,1-bedroom, 2-bedroom, and 3-bedroom units) or to schedule a visit!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lachine/23699035?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "88, Rue Charlotte, apt. 712, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "818 sqft",
    "description": "Superb condo with 2 bedrooms and 2 bathrooms in the heart of downtown! Very bright with its huge windows, hardwood floors and granite countertops. One interior garage and locker are included. Close to the Quartier des Spectacles, old port, Chinatown, 4 metro stations and all other services. A must see!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/20729797?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "200, boulevard Marcel-Laurin, apt. 213, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2450",
    "area": "Not specified",
    "description": "For rent,, 2 bedrooms & 2 bathrooms condos, located on the 2nd floor at CITÉ MIDTOWN project. All appliances are included in the lease and 1 parking and 1 locker. Available July 1st. Lessee must submit a full copy of their equifax report, proof of employment and any other info the lessor may require. Condo is non-Smoking (cigarettes or cannabis) No domestic pets. Tenants must provide civil liability insurance for $2 million.  Lessee is responsible for any costs related to moving in or out. Lessee must open a hydro Quebec account prior to occupancy.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/17577010?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4227, boulevard Saint-Jean, apt. 302, Dollard-des-Ormeaux, Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$1900",
    "area": "750 sqft",
    "description": "Welcome to 4227 St-Jean, this 750 sqft condo with high-end finishings, appliances included, a master bedroom with an en-suite bathroom and walk in closet, and a second bedroom. Open-concept kitchen and living area. Large kitchen island, great for entertaining. One parking included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/23588149?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "15641, Rue Forsyth, Montréal (Rivière-des-Prairies/Pointe-aux-Trembles), Neighbourhood Pointe-aux-Trembles",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "826 sqft",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-riviere-des-prairies-pointe-aux-trembles/24280453?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2200, Rue Sauvé Ouest, apt. 610, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2280",
    "area": "Not specified",
    "description": "PROMOTION: One month of free rent and 6 months of free parking  Welcome to Voltige: Common areas and services:  Urban chalet featuring a pool table, large-screen TV, gas fireplace, and fully equipped kitchen for cozy get-togethers Terrace with BBQ and dining areas Outdoor pool Fully equipped gym Party room for special events Indoor and outdoor parking Bicycle parking Concierges and security guard Charging stations for electric vehicles",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/20658377?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2200, Rue Sauvé Ouest, apt. 2302, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2290",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/9191081?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 8, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/17396774?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5700, boulevard Cavendish, apt. 1701, Côte-Saint-Luc",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "981 sqft",
    "description": "Fully furnished condo with exceptional views on 17th floor. Ideally located near all shops and services on cavendish. Furniture, appliances, heat, central air conditioning,  hot water and garage are included.  Pool, gym and sauna! Can be rented unfurnished",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~cote-saint-luc/16709019?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1333, Rue De Castelnau Est, apt. 2, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$1950",
    "area": "Not specified",
    "description": "Superb corner unit with 2 bedrooms in heart of Villeray.  Features include quartz countertops, porcelain tiles, ceramic backsplash, two full bathrooms, separate bath and shower, mural AC, air exchanger system and private balcony. Unit is complete with brand new fridge, range, dishwasher, microwave, washer and dryer! Just a 5 minute walk from Fabre metro station. Here is your chance to live a luxurious lifestyle without having a mortgage or a down payment! Obligatory credit check and proof of income. Smoking and pets prohibited(with exception of 1 cat). Currently under construction.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/23363401?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "200, boulevard Marcel-Laurin, apt. 101, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "965 sqft",
    "description": "Immerse yourself in the epitome of urban living at CITÉ MIDTOWN - PHASE 2 with this stunning condo offering a seamless blend of style and convenience. Entertain effortlessly in the open concept kitchen and living room, while the 2 bedrooms provide comfort and privacy. Enjoy the luxury of a private terrace, perfect for morning coffee or evening cocktails with city views. Indulge in the onsite café bistro and grocery store, or stay active in the fully equipped fitness and yoga room. With 2 lounges and more amenities awaiting, every day feels like a getaway. Welcome home to sophisticated city living at its finest.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/15532688?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6280, Place Northcrest, apt. 715, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$1790",
    "area": "871 sqft",
    "description": "Conveniently situated in a prime location with unbeatable access to local amenities and public transportation. This inviting apartment features a practical layout that maximizes space and offers ample natural light. It's equipped with all the essentials for everyday living, with easy access to shops, parks, and restaurants just steps away. Enjoy the benefit of quick commutes with nearby bus and metro blue line. Ideal for those seeking convenience and accessibility, this apartment provides a cozy retreat in the heart of the city's bustling environment.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/28675666?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6280, Place Northcrest, apt. 919, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$1950",
    "area": "1,024 sqft",
    "description": "Conveniently situated in a prime location with unbeatable access to local amenities and public transportation. This inviting apartment features a practical layout that maximizes space and offers ample natural light. It's equipped with all the essentials for everyday living, with easy access to shops, parks, and restaurants just steps away. Enjoy the benefit of quick commutes with nearby bus and metro blue line. Ideal for those seeking convenience and accessibility, this apartment provides a cozy retreat in the heart of the city's bustling environment.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/22537121?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1288, Rue Saint-Antoine Ouest, apt. 711, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "740 sqft",
    "description": "Unité incroyable dans le projet supérieur TDC3, 2 chambres et 2 salles de bains avec une vue spectaculaire sur la ville. Les installations incroyables comprennent Skylounge, salle d'exercice, piscine, spa, etc. À proximité de tous les services, distance de marche des métros Lucien-L'Allier et Bonaventure, de la gare centrale et du Centre Bell.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/22095425?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1466, Avenue Ducharme, apt. 5, Montréal (Outremont)",
    "features": "2 beds, 2 baths",
    "price": "$2390",
    "area": "Not specified",
    "description": "Charming renovated 2-bedroom condo. Spacious living room, brand new kitchen. 2 large bedrooms with windows. Located on a beautiful and peaceful street near Parc Kennedy, MIL, Outremont Station, St-Viateur Park, Lajoie schools, and Stanislas College. Close to Van Horne and Bernard avenues with their shops, cafes, and restaurants.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-outremont/19302029?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "98, Rue Charlotte, apt. 454, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$1990",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/27478991?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "11, Avenue Gendron, apt. 606, Pointe-Claire, Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2390",
    "area": "972 sqft",
    "description": "Welcome to 11 Av. Gendron, the flagship building of the Equinox LEED development by Sotramont. Here you will find the perfect combination of vibrant urban chic in a friendly suburban community. The condo features a spacious, open-plan living room, dining room and kitchen, 2 great bedrooms, a beautiful 4-piece bathroom, plus a handy powder room for your guests, 10' ceilings on the penthouse level, single garage and a storage locker. Conveniently located close to shops, restaurants, Fairview mall & the future REM, easy access to highway 40 & 20.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/22384411?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1400, Rue Ottawa, apt. 120A, Montréal (Le Sud-Ouest), Neighbourhood Griffintown",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/14179042?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "300, Avenue George-V, apt. 501, Montréal (Lachine), Neighbourhood East",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "845 sqft",
    "description": "Welcome to this immaculate 2022-built fully furnished two-bedroom, two-bathroom condo - 5th floor corner unit flooded with natural light and a 10 feet ceiling. The sleek kitchen, equipped with modern appliances, seamlessly connects to a cozy living/dining area. The primary bedroom offers enough space for a king-size bed and nightstands, while the second bedroom is perfect for an office space. The full bathroom showcases contemporary finishes. Don't miss the chance to own this prime piece of modern living.  -- Rental: Deposit of 1 month rent and Pre-rental verification required (Credit,Employement)",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lachine/17042139?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7418, Rue Saint-Gérard, apt. 3, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "1,115 sqft",
    "description": "Elegant and modern 2022 construction. This property is on the top floor and includes high quality finishes with 2 bedrooms and 2 bathrooms. In the heart of Montreal and within walking distance of the Jean-Talon market, the Jean-talon metro, Pharmaprix and Parc Jarry. Available for July 1, 2024",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/14383517?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "205, Chemin Bates, apt. 504, Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2490",
    "area": "Not specified",
    "description": "Luxurious condo in Ville Mont-Royal, construction 2023, on the 5th floor, 2 bedrooms, 2 bathrooms including one in the master bedroom, walk-in wardrobe in the master bedroom, shed included, 2 indoor parking spaces included, parking for visitors, hot water included, 5 appliances included, very large balcony with a view of the Laurentians and the sunset, no rear neighbors, gymnasium in the building, very secure, intercom on cell phone, very well soundproofed, air conditioning central, access to the best schools in Mont-Royal, 5 minutes from Canora train station and Outremont restaurants/cafes. Accepted animals. Available July 1st.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~mont-royal/25274438?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "21A, Avenue Strathyre, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$1800",
    "area": "Not specified",
    "description": "Brand new unit very modern with flexible occupancy. Presently vacant. At owners request mandatory credit check, no pets, non smokers and rental is for maximum of 2 people. Only a few steps to water front and cycle path. All in one of the most charming and residential  area of Lasalle",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/26658367?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "520, boulevard de la Côte-Vertu, apt. 403, Montréal (Saint-Laurent), Neighbourhood Others",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "Not specified",
    "description": "Available as of June 15th 2024   FULLY FURNISHED. Ideal proximity, 5 minutes walk from train station! This beautiful, bright furnished condo offers a beautiful view to the south with a renovated kitchen and granite countertops. Includes garage parking and locker.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/22490105?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3770, Rue Bélair, apt. 201, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Saint-Michel",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/21476532?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "88, Rue Charlotte, apt. 102, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "751 sqft",
    "description": "FULLY FURNISHED. Perfect for investors, healthcare workers, professionals, students, a pied-à-terre, or simply those who want to live in the heart of Montreal. Close to restaurants, shops, cafes, CHUM, and just minutes from St-Laurent and Champ-de-Mars metro stations. Near McGill, Concordia, and UQAM universities, Place des Arts, Complexe Desjardins, and Old Montreal. Fully furnished with 2 beds, sofa, dining table, microwave, dishwasher, washer and dryer, refrigerator, stove, television, alarm system, air conditioning, parking, and locker!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/19558736?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1251, Rue Ottawa, apt. 605, Montréal (Le Sud-Ouest), Neighbourhood Griffintown",
    "features": "2 beds, 2 baths",
    "price": "$2329",
    "area": "Not specified",
    "description": "Au coeur de Griffintown. 82 appartements neufs de une, deux, trois et quatre chambres à coucher. Certains appartements ont deux salles de bain. Les électrosménagers sont inclus ainsi que l`eau chaude. Gymnase dans la bâtisse. Possibilité de louer un espace de stationnement intérieur pour 230$ mensuel",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/11541780?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Brunswick, apt. 327, Pointe-Claire, Neighbourhood North",
    "features": "2 beds, 2 baths",
    "price": "$2165",
    "area": "Not specified",
    "description": "**LIMITED PROMO - ONE MONTH FREE ** Enjoy a refined, stress-free lifestyle in the heart of Pointe-Claire. Westpark, the new high-end rental condo complex in Pointe-Claire. This community of 255 1- to 3-bedroom apartments represents the perfect balance between urban living and proximity to all services with its 15-minute neighbourhood. Picture an ideal location where all your needs are just steps away. Within walking distance, you'll have privileged access to a variety of first-rate stores, including the prestigious CF Fairview Pointe-Claire, for an unparalleled shopping experience.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/24012046?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Brunswick, apt. 705, Pointe-Claire, Neighbourhood North",
    "features": "2 beds, 2 baths",
    "price": "$2245",
    "area": "Not specified",
    "description": "**LIMITED PROMO - ONE MONTH FREE ** Enjoy a refined, stress-free lifestyle in the heart of Pointe-Claire. Westpark, the new high-end rental condo complex in Pointe-Claire. This community of 255 1- to 3-bedroom apartments represents the perfect balance between urban living and proximity to all services with its 15-minute neighbourhood. Picture an ideal location where all your needs are just steps away. Within walking distance, you'll have privileged access to a variety of first-rate stores, including the prestigious CF Fairview Pointe-Claire, for an unparalleled shopping experience.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/21429546?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "265, boulevard Brunswick, apt. 201, Pointe-Claire, Neighbourhood North",
    "features": "2 beds, 2 baths",
    "price": "$2236",
    "area": "Not specified",
    "description": "**LIMITED PROMO - ONE MONTH FREE ** Enjoy a refined, stress-free lifestyle in the heart of Pointe-Claire. Westpark, the new high-end rental condo complex in Pointe-Claire. This community of 255 1- to 3-bedroom apartments represents the perfect balance between urban living and proximity to all services with its 15-minute neighbourhood. Picture an ideal location where all your needs are just steps away. Within walking distance, you'll have privileged access to a variety of first-rate stores, including the prestigious CF Fairview Pointe-Claire, for an unparalleled shopping experience.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/20676814?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "17, Place de la Triade, apt. 810, Pointe-Claire, Neighbourhood Central East",
    "features": "2 beds, 2 baths",
    "price": "$2430",
    "area": "Not specified",
    "description": "Welcome to Urban West, your dream rental destination in Pointe-Claire! Near Highway 20/40, IGA, Walmart, Home Depot, and a Pharmacy, it offers easy access to all your daily needs. Explore modern amenities, including a rooftop lounge with stunning views. Stay active in our fully-equipped gym and cool off in the refreshing pool. Your stylish new home features stainless steel appliances and high-end finishings. Parking available at an additional cost, and small pets are welcomed! Book your visit today![Displayed images depict standard finishes for units, with potential variations in both finishes and layout]",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~pointe-claire/19086986?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5700, boulevard Cavendish, apt. 1208, Côte-Saint-Luc",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~cote-saint-luc/14137408?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2355, Rue des Équinoxes, apt. 405, Montréal (Saint-Laurent), Neighbourhood New Saint-Laurent/Bois-Franc",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "Not specified",
    "description": "Beautiful and bright 2 large bedrooms and 2 bathrooms corner condo in the brand-new project AURA in Bois-Franc. High windows with abundant natural light, open concept layout, modern kitchen with end high appliances. Primary bedroom with walk-in closet and ensuite bathroom. Second large bedroom and nice sized bathroom. All the appliances and hot water included as well, 1 indoor parking and 1 locker, building with 2 elevators, gym, and rooftop terrace. Located in a prestigious project offers high-end finishes, ample natural light, and exceptional soundproofing offering top-tier amenities and great location.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/15125226?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1423, Rue Drummond, apt. 201, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "830 sqft",
    "description": "Au coeur du centre-ville de Montréal, à côté de la rue Sainte-Catherine et Crescent.  À distance de marche de l'Université McGill et Concordia et près de tous les services publics (Metro, Train, Autobus, Supermarché, Centre commercial, Restaurant, Bar, Gym).",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/27617384?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2160, Rue Cartier, apt. 203, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "1,122 sqft",
    "description": "This charming unit is extremely spacious boasting 1,121 square feet, very bright offering optimal sunlight all day long. As well, open concept dining/living room, 2 spacious bedrooms, powder room and full bathroom. 10 min walk to the metro, moments away from Ontario E., all major amenities, autoroute, downtown Montreal & Lafontaine Park. Definitely worth a visit. Parking not included, however can be arranged. Hydro and tenant insurance are extra",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/25639461?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5780, Avenue Decelles, apt. 307, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2150",
    "area": "1,021 sqft",
    "description": "Beautiful condo in the heart of Cote-des-Neiges. Enjoy a 2 bedroom condo, walk-in closet, indoor parking, gas fireplace, terrace on the roof, 24 hour video surveillance and walking distance to the metro, hospitals, University of Montreal and Jean de Brébeuf College.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/18284420?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "10120, Rue Lauraine-Vaillancourt, apt. 503, Montréal (Ahuntsic-Cartierville), Neighbourhood Ahuntsic West",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/17220695?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4500, Chemin de la Côte-des-Neiges, apt. 408, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2325",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/15424027?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "205, Chemin Bates, apt. 407, Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2390",
    "area": "Not specified",
    "description": "LUXURY CONDO IN VILLE MONT-ROYAL RECENT CONSTRUCTION. Corner unit, on the 4th floor, 2 bedrooms, 2 bathrooms including one in the master bedroom, walk-in wardrobe in the master bedroom, shed included, indoor parking included (2nd parking possible), parking for visitors , hot water included, 5 appliances included, very large balcony, gymnasium in the building, very secure (camera), intercom on cell phone, very well soundproofed, central air conditioning, access to the best schools in Mont-Royal, 5 minutes away of the REM, located in the heart of Montreal, a visit is essential!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~mont-royal/21358466?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3445, Rue Drummond, apt. 804, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "1,146 sqft",
    "description": "Spacious 2 bedroom unit steps away from Mcgill University, with 2 full bathrooms and a large balcony. Perfect for student roommates. Building offers central heating and hot water. Amenities include a gym, an indoor pool, 2 terraces and 24/7 security guards. Condo fees include heating and hot water.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/27277695?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3540, Avenue de l'Hôtel-de-Ville, apt. 104, Montréal (Le Plateau-Mont-Royal), Neighbourhood Le Plateau-Mont-Royal",
    "features": "2 beds, 2 baths",
    "price": "$2150",
    "area": "650 sqft",
    "description": "This condo offers everything you need and more in the lively Plateau Mont-Royal area. There are 650 square feet on two floors, with the basement offering two bedrooms, a full bathroom and the upper floor offers a kitchen with a dining area and living room opening onto a small terrace. With restaurants, cafes, markets, and shops all within walking distance to explore the plateau at its best.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-plateau-mont-royal/23806438?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "445, boulevard Saint-Joseph Ouest, apt. 87, Montréal (Outremont)",
    "features": "2 beds, 2 baths",
    "price": "$2450",
    "area": "1,241 sqft",
    "description": "Cuisine rénover!! Apartement de luxe dans un des quartiers les plus désirés de Montreal! Apartement de plus de 1200pc, avec  balcon privé, Chauffage inclus! Vue Sur le Mont Royale, cet Apartement a juste deux pas de la rue Laurier! Proximité de toutes les belles restaurants et boutiques, et à 10 minutes de centre-ville. One visit s'impose.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-outremont/14312158?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2905, boulevard de la Côte-Vertu, apt. 501, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "1,212 sqft",
    "description": "Beautiful condo for rent with 2 bedroom, 2 bathroom, 1 indoor garage space. Outdoor pool. Renovated kitchen & bathrooms. Excellent location, close to highways 40, 13 & 520. Walking distance to Place Vertu, all amenities, public transport, metro Cote Vertu, schools, daycares, parks, Raymond Bourke Arena and much more.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/22473114?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3000, boulevard Thimens, apt. 619, Montréal (Saint-Laurent), Neighbourhood Saint-Laurent West",
    "features": "2 beds, 2 baths",
    "price": "$2295",
    "area": "Not specified",
    "description": "**LE MONARC Phase 2**: Be the first to inhabit this newly constructed 2-bedroom, 2-bathroom unit in the new Monarc development, boasting LEED certification. Contemporary corner unit features expansive windows offering panoramic views. Enjoy the open-concept living area, complete with a beautiful kitchen with high end appliances & backsplash. Primary bedroom includes a walk-in closet and ensuite bathroom. Includes a second bedroom and bathroom. Building amenities abound, including a fitness center, yoga room, indoor pool, and more (details in addendum). Comes with 1 indoor parking space and a storage locker. Near shops, parks & transportation.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-laurent/19802452?view=Summary"
  },
  {
    "category": "House for rent",
    "address": "332, Rue Trudeau, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$1975",
    "area": "Not specified",
    "description": "Two-storey house for rent in a beautiful LaSalle neighborhood. This property offers 2 bedrooms with the possibility of a third. Spacious kitchen and living room on the main level with powder/laundry room and office space. The 2nd floor has a full bathroom and 2 bedrooms. The spacious basement can be used as a family room or for storage. The large private backyard is perfect for summer enjoyment. Central A/C available for your convenience. Close to all amenities. We're looking for quality tenants with excellent references. Pets are not allowed and smoking is prohibited.",
    "summary_url": "https://www.centris.ca/en/maison~a-louer~montreal-lasalle/9644141?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "800, Rue Villeray, Montréal (Villeray/Saint-Michel/Parc-Extension), Neighbourhood Villeray",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "Not specified",
    "description": "BEAUTIFUL 4 1/2 FOR RENT 800 rue Villeray   Beautiful new condo (2 bedrooms, 2 bathrooms) available as of 1st june 2024)",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-villeray-saint-michel-parc-extension/11336780?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "445, boulevard Saint-Joseph Ouest, apt. 54, Montréal (Outremont)",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "1,241 sqft",
    "description": "Photos a venir. Libre immédiatement!!Chauffage inclus! Cuisine rénover! Meilleure prix/pc !! Fraichement peinturé! Apartement de luxe dans un des quartiers les plus désirés de Montreal. Vue sur le Mont-Royale, cet apartement est a deux pas de la rue Laurier et toutes les restaurants et boutiques! Balcon privé! À 10 minutes de centre-ville! Une visite s'impose.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-outremont/24053852?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6598, boulevard Saint-Laurent, apt. 3, Montréal (Rosemont/La Petite-Patrie), Neighbourhood Little Italy",
    "features": "2 beds, 2 baths",
    "price": "$2200",
    "area": "Not specified",
    "description": "Beautiful 2 bedroom and 2 bathroom apartment  newly renovated . close to all services , coffee shops and restaurants. all brand new appliances included",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-rosemont-la-petite-patrie/25031125?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "4227, boulevard Saint-Jean, apt. 505, Dollard-des-Ormeaux, Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$1950",
    "area": "780 sqft",
    "description": "Welcome to 4227 St-Jean, this 780 sqft condo with high-end finishings, appliances included, a master bedroom with an en-suite bathroom and a second room to be used as an office space or child's bedroom. Open-concept kitchen and living area. Kitchen island, great for entertaining. One parking included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~dollard-des-ormeaux/17964866?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1288, Rue Saint-Antoine Ouest, apt. 2603, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2250",
    "area": "Not specified",
    "description": "Credit check, proof of employement, previous landlord reference, no pet, no smoke,no drug, no marijuana, no airbnb",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/21150324?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3787, Chemin de la Côte-des-Neiges, apt. 318, Montréal (Ville-Marie), Neighbourhood Central West",
    "features": "2 beds, 2 baths",
    "price": "$2400",
    "area": "Not specified",
    "description": "Welcome to 3787 Côte-des-Neiges, a charming 4 1/2 apartment nestled in the heart of NDG. This cozy unit features two spacious bedrooms, perfect for a small family or roommates looking to enjoy the vibrant neighborhood.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/22886527?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "6993, boulevard Décarie, apt. 1401, Montréal (Côte-des-Neiges/Notre-Dame-de-Grâce), Neighbourhood Côte-des-Neiges",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "Welcome to Devmont newest project; WESTBURY GREEN! Be among the first to live in this state of the art building in the highly sought after Westbury Neighbourhood! All of Westbury Green apartments include hydro, 6 appliances, high speed internet and beautiful common spaces! Ideal location near Starbucks, Supermarché PA, Forno West,Brasserie Blandino, Pancho, all surrounded by the beautiful greenery of Parc Elie Weisel.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-cote-des-neiges-notre-dame-de-grace/18757052?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3465, Rue Redpath, apt. 706, Montréal (Ville-Marie), Neighbourhood Golden Square Mile",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "1,207 sqft",
    "description": "** ACCOMMODATION ** - Large renovated 2 bedrooms unit. - 1 bathroom and 1 powder room. - Large balcony. - Wall-mounted air conditioning ** BUILDING ** - Laundry room in the basement. - Concierge on site. - 2 elevators. - Surveillance cameras. - Other units are available in the building (1, 2, 3 bedrooms). ** CONDITIONS ** - Cats accepted under approval. - Mandatory tenant insurance. - Short term rental prohibited. - Non-smoking accommodation. - Mandatory credit check.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/15297152?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1288, Rue Saint-Antoine Ouest, apt. 703, Montréal (Ville-Marie), Neighbourhood Central",
    "features": "2 beds, 2 baths",
    "price": "$2495",
    "area": "652 sqft",
    "description": "Welcome to the contemporary condo in Tour des Canadians 3, enjoy open concept living space + 2 bedrooms + 2 Bathrooms, high-end finishing, floor to ceiling windows with spectacular views of the city! Excellant location, where everything is minutes away from going to work or university! One parking space is included.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/9635316?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "1601, Rue Viola-Desmond, apt. 637, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2150",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/16060490?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "220, Chemin du Golf, apt. 208, Montréal (Verdun/Île-des-Soeurs), Neighbourhood Île-des-Soeurs",
    "features": "2 beds, 2 baths",
    "price": "$2300",
    "area": "872 sqft",
    "description": "Project SAX II - Gorgeous urban condo on 2 floors with pool view and interior court. Open-concept kitchen, dining and living room. Rare layout. 1+1 bedrooms upstairs gives this condo the feel of a townhouse. 2 balconies, 1 well-placed garage and locker. Close proximity to all services makes it a sought-after location. Available for immediate occupancy.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-verdun-ile-des-soeurs/11020243?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "195, Chemin de la Côte-Sainte-Catherine, apt. 105, Montréal (Outremont)",
    "features": "2 beds, 2 baths",
    "price": "$2395",
    "area": "1,016 sqft",
    "description": "** APARTMENT ** - Entirely renovated 2 bedrooms apartment - 1 full bathroom and 1 powder room - Large rooms - 2 Balconies  ** BUILDING ** - Swimming pool, sauna and exterior terrace - Concierge on site - Elevator - Surveillance cameras - Garbage chutes - Quiet building - Other units are available in the building (1, 2 bedrooms)  ** LOCATION ** - Near Mount Royal park - Few step away from Laurier street and all its shops - Close to Bernard Ave. and Mile-End.  ** TERMS ** - Cat accepted under approval - Mandatory tenant insurance - Short term rental prohibited - Non-smoking accommodation - Mandatory credit check",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-outremont/12713960?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7607, Rue de Boischatel, Montréal (Saint-Léonard)",
    "features": "2 beds, 2 baths",
    "price": "$1900",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-leonard/11661662?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "3033, Rue Sherbrooke Ouest, apt. 105, Westmount",
    "features": "2 beds, 2 baths",
    "price": "$2350",
    "area": "1,165 sqft",
    "description": "** APARTMENT ** - Entirely renovated 2 bedrooms apartment. - 2 full bathrooms. - Large rooms.  ** BUILDING ** - Concierge on site - 2 elevators - Surveillance cameras - Waste chutes - Quiet building - Other units are available in the building (2, 3 bedrooms)  ** LOCATION ** - Opposite Dawson College - On bus line 24 (Sherbrooke west). - 5 minutes walk from Atwater metro (green line).  ** TERMS ** - Cats accepted under approval - Mandatory tenant insurance - Short term rental prohibited - Non-smoking accommodation - Mandatory credit check",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~westmount/24153442?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "5445, Rue de Meudon, apt. 605, Montréal (Saint-Léonard)",
    "features": "2 beds, 2 baths",
    "price": "$2000",
    "area": "966 sqft",
    "description": "Découvrez cet élégant appartement à louer, situé au 6ème étage au 5445 Rue de Meudon, app. 605, à Montréal. Pour 2200$ par mois, profitez de 2 chambres à coucher spacieuses et 2 salles de bain modernes. Cet appartement lumineux bénéficie de grandes fenêtres offrant une vue imprenable sur la ville. La cuisine contemporaine est entièrement équipée et ouverte sur le salon, idéal pour recevoir. Les chambres sont dotées de rangements généreux et les salles de bain sont conçues avec des finitions haut de gamme. Parfaitement situé, vous êtes à proximité des commerces, restaurants, transports en commun et espaces verts. Une occasion unique de vivre d",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-saint-leonard/15314649?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "315, Rue Richmond, apt. 212, Montréal (Le Sud-Ouest), Neighbourhood Griffintown",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "Not specified",
    "description": "empty",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-le-sud-ouest/23810350?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "777, Rue Gosford, apt. 404, Montréal (Ville-Marie), Neighbourhood Old Montréal",
    "features": "2 beds, 2 baths",
    "price": "$2500",
    "area": "1,008 sqft",
    "description": "This unit has 2 bedrooms, 2 bathrooms, an inside parking space and a wonderful view of the city. What more could you ask for? This corner unit offers a beautiful living space. Exceptional location, close to the highway entrance, restaurants, and the vibrant life of Old Montreal. Just a few minutes' walk from the metro. A visit is a must!",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ville-marie/16025028?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "7028, Rue Marie-Rollet, apt. 2B, Montréal (LaSalle)",
    "features": "2 beds, 2 baths",
    "price": "$2100",
    "area": "1,237 sqft",
    "description": "Spacious 2 bedroom, 2 bathroom condo ideally located between Angrignon Park & shopping center. Quiet street, minutes from the Angrignon metro station. Neat & nicely finished interior, large ensuite bathroom, natural gas fireplace and balconies in both front and back. Well maintained & managed building with elevator. Nice outdoor inground pool to cool off.",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-lasalle/24600461?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2000, Rue Sauvé Ouest, apt. 701, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$1950",
    "area": "Not specified",
    "description": "PROMOTION: One month of free rent. Welcome to Voltige: Common areas and services:  Urban chalet featuring a pool table, large-screen TV, gas fireplace, and fully equipped kitchen for cozy get-togethers Terrace with BBQ and dining areas Outdoor pool Fully equipped gym Party room for special events Indoor and outdoor parking Bicycle parking Concierges and security guard Charging stations for electric vehicles",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/21538223?view=Summary"
  },
  {
    "category": "Condo / Apartment for rent",
    "address": "2200, Rue Sauvé Ouest, apt. 1403, Montréal (Ahuntsic-Cartierville), Neighbourhood Nouveau Bordeaux",
    "features": "2 beds, 2 baths",
    "price": "$2385",
    "area": "Not specified",
    "description": "PROMOTION: One month of free rent . Welcome to Voltige: Common areas and services:  Urban chalet featuring a pool table, large-screen TV, gas fireplace, and fully equipped kitchen for cozy get-togethers Terrace with BBQ and dining areas Outdoor pool Fully equipped gym Party room for special events Indoor and outdoor parking Bicycle parking Concierges and security guard Charging stations for electric vehicles",
    "summary_url": "https://www.centris.ca/en/condo-appartement~a-louer~montreal-ahuntsic-cartierville/16847010?view=Summary"
  }
]